tap 'caskroom/cask'

# Core Homebrew
brew 'antigen'
brew 'bat'
brew 'colordiff'
brew 'git'
brew 'git-filter-repo'
brew 'httpie'
brew 'jq'
brew 'neovim'
brew 'node'
brew 'peco'
brew 'ripgrep'
brew 'sketchybar'
brew 'skhd'
brew 'snappy'
brew 'starship'
brew 'wget'
brew 'yabai'
brew 'yt-dlp'
brew 'zoxide'
brew 'altair-graphql-client'
brew 'discord'
brew 'font-fantasque-sans-mono'
brew 'font-fantasquesansmono-nerd-font'
brew 'font-fira-code'
brew 'font-firacode-nerd-font'
brew 'font-hack-nerd-font'
brew 'font-ibm-plex-sans'
brew 'font-public-sans'
brew 'font-sf-pro'
brew 'font-source-code-pro'
brew 'iina'
brew 'keepingyouawake'
brew 'racket'
brew 'sf-symbols'
brew 'wezterm'

# Cask Apps

vscode "adpyke.codesnap"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bibhasdn.django-html"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bodil.prettier-toml"
vscode "bungcip.better-toml"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "coolbear.systemd-unit-file"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "evzen-wybitul.pollen"
vscode "ExecutableBookProject.myst-highlight"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "iocave.monkey-patch"
vscode "janisdd.vscode-edit-csv"
vscode "jinliming2.vscode-go-template"
vscode "joaompinto.vscode-graphviz"
vscode "kamikillerto.vscode-colorize"
vscode "leonzalion.vscode-ejs"
vscode "lextudio.restructuredtext"
vscode "lextudio.restructuredtext-pack"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "matt-meyers.vscode-dbml"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-scss"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "pomdtr.excalidraw-editor"
vscode "rid9.datetime"
vscode "ronnidc.nunjucks"
vscode "samuelcolvin.jinjahtml"
vscode "skellock.just"
vscode "stkb.rewrap"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "trond-snekvik.simple-rst"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsls-contrib.codetour"
vscode "XadillaX.viml"
vscode "yzhang.markdown-all-in-one"
