# tap 'homebrew/cask'
brew 'antigen'
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-filter-repo'
brew 'httpie'
brew 'jq'
brew 'just'
brew 'neovim'
brew 'node'
brew 'node-sass'
brew 'peco'
brew 'pre-commit'
brew 'ripgrep'
brew 'rtx'
brew 'FelixKratz/formulae/sketchybar'
brew 'koekeishiya/formulae/skhd'
brew 'starship'
brew 'tealdeer'
brew 'trash'
brew 'koekeishiya/formulae/yabai'
brew 'zoxide'
brew 'basictex'
brew 'discord'
brew 'font-firacode-nerd-font'
brew 'font-ibm-plex-sans'
brew 'font-public-sans'
brew 'font-source-sans-3'
brew 'sf-symbols'
brew 'slack'
brew 'wezterm'
brew 'google-chrome'
brew 'raycast'
brew 'slack'

